Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.ExtendedProperties Property
 An external resource type representing extended properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType ExtendedProperties { get; }
Public Shared ReadOnly Property ExtendedProperties As ExternalResourceType
	Get
public:
static property ExternalResourceType^ ExtendedProperties {
	ExternalResourceType^ get ();
}
static member ExtendedProperties : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace